{
    "format": "layers-model",
    "generatedBy": "keras v2.13.1",
    "convertedBy": "TensorFlow.js Converter v4.9.0",
    "modelTopology": {
        "keras_version": "2.13.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                250
                            ],
                            "dtype": "int32",
                            "sparse": false,
                            "ragged": false,
                            "name": "dense_input"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "sigmoid"
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "SparseCategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "sparse_categorical_crossentropy",
                    "from_logits": true,
                    "ignore_class": null,
                    "fn": "sparse_categorical_crossentropy"
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "sparse_categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>Adam",
                "config": {
                    "name": "Adam",
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "jit_compile": false,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0010000000474974513,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        250,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}